{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_5", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_6"}, "name": "input_6", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "batch_input_shape": [null, 128], "dtype": "float32", "units": 16384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_5", "trainable": true, "dtype": "float32", "target_shape": [1024, 4, 4]}, "name": "reshape_5", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_55", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_55", "inbound_nodes": [[["reshape_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_60", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_60", "inbound_nodes": [[["batch_normalization_55", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_50", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_50", "inbound_nodes": [[["activation_60", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_80", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_80", "inbound_nodes": [[["conv2d_transpose_50", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_56", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_56", "inbound_nodes": [[["conv2d_80", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_61", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_61", "inbound_nodes": [[["batch_normalization_56", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_51", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_51", "inbound_nodes": [[["reshape_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_81", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_81", "inbound_nodes": [[["activation_61", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_82", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_82", "inbound_nodes": [[["conv2d_transpose_51", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_25", "trainable": true, "dtype": "float32"}, "name": "add_25", "inbound_nodes": [[["conv2d_81", 0, 0, {}], ["conv2d_82", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_57", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_57", "inbound_nodes": [[["add_25", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_62", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_62", "inbound_nodes": [[["batch_normalization_57", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_52", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_52", "inbound_nodes": [[["activation_62", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_83", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_83", "inbound_nodes": [[["conv2d_transpose_52", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_58", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_58", "inbound_nodes": [[["conv2d_83", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_63", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_63", "inbound_nodes": [[["batch_normalization_58", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_53", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_53", "inbound_nodes": [[["add_25", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_84", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_84", "inbound_nodes": [[["activation_63", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_85", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_85", "inbound_nodes": [[["conv2d_transpose_53", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_26", "trainable": true, "dtype": "float32"}, "name": "add_26", "inbound_nodes": [[["conv2d_84", 0, 0, {}], ["conv2d_85", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_59", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_59", "inbound_nodes": [[["add_26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_64", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_64", "inbound_nodes": [[["batch_normalization_59", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_54", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_54", "inbound_nodes": [[["activation_64", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_86", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_86", "inbound_nodes": [[["conv2d_transpose_54", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_60", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_60", "inbound_nodes": [[["conv2d_86", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_65", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_65", "inbound_nodes": [[["batch_normalization_60", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_55", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_55", "inbound_nodes": [[["add_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_87", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_87", "inbound_nodes": [[["activation_65", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_88", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_88", "inbound_nodes": [[["conv2d_transpose_55", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_27", "trainable": true, "dtype": "float32"}, "name": "add_27", "inbound_nodes": [[["conv2d_87", 0, 0, {}], ["conv2d_88", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_61", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_61", "inbound_nodes": [[["add_27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_66", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_66", "inbound_nodes": [[["batch_normalization_61", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_56", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_56", "inbound_nodes": [[["activation_66", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_89", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_89", "inbound_nodes": [[["conv2d_transpose_56", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_62", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_62", "inbound_nodes": [[["conv2d_89", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_67", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_67", "inbound_nodes": [[["batch_normalization_62", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_57", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_57", "inbound_nodes": [[["add_27", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_90", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_90", "inbound_nodes": [[["activation_67", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_91", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_91", "inbound_nodes": [[["conv2d_transpose_57", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_28", "trainable": true, "dtype": "float32"}, "name": "add_28", "inbound_nodes": [[["conv2d_90", 0, 0, {}], ["conv2d_91", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_63", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_63", "inbound_nodes": [[["add_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_68", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_68", "inbound_nodes": [[["batch_normalization_63", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_58", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_58", "inbound_nodes": [[["activation_68", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_92", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_92", "inbound_nodes": [[["conv2d_transpose_58", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_64", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_64", "inbound_nodes": [[["conv2d_92", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_69", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_69", "inbound_nodes": [[["batch_normalization_64", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_59", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_59", "inbound_nodes": [[["add_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_93", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_93", "inbound_nodes": [[["activation_69", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_94", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_94", "inbound_nodes": [[["conv2d_transpose_59", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_29", "trainable": true, "dtype": "float32"}, "name": "add_29", "inbound_nodes": [[["conv2d_93", 0, 0, {}], ["conv2d_94", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_65", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_65", "inbound_nodes": [[["add_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_70", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_70", "inbound_nodes": [[["batch_normalization_65", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_95", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_95", "inbound_nodes": [[["activation_70", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_71", "trainable": true, "dtype": "float32", "activation": "tanh"}, "name": "activation_71", "inbound_nodes": [[["conv2d_95", 0, 0, {}]]]}], "input_layers": [["input_6", 0, 0]], "output_layers": [["activation_71", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of63.bin", "group1-shard2of63.bin", "group1-shard3of63.bin", "group1-shard4of63.bin", "group1-shard5of63.bin", "group1-shard6of63.bin", "group1-shard7of63.bin", "group1-shard8of63.bin", "group1-shard9of63.bin", "group1-shard10of63.bin", "group1-shard11of63.bin", "group1-shard12of63.bin", "group1-shard13of63.bin", "group1-shard14of63.bin", "group1-shard15of63.bin", "group1-shard16of63.bin", "group1-shard17of63.bin", "group1-shard18of63.bin", "group1-shard19of63.bin", "group1-shard20of63.bin", "group1-shard21of63.bin", "group1-shard22of63.bin", "group1-shard23of63.bin", "group1-shard24of63.bin", "group1-shard25of63.bin", "group1-shard26of63.bin", "group1-shard27of63.bin", "group1-shard28of63.bin", "group1-shard29of63.bin", "group1-shard30of63.bin", "group1-shard31of63.bin", "group1-shard32of63.bin", "group1-shard33of63.bin", "group1-shard34of63.bin", "group1-shard35of63.bin", "group1-shard36of63.bin", "group1-shard37of63.bin", "group1-shard38of63.bin", "group1-shard39of63.bin", "group1-shard40of63.bin", "group1-shard41of63.bin", "group1-shard42of63.bin", "group1-shard43of63.bin", "group1-shard44of63.bin", "group1-shard45of63.bin", "group1-shard46of63.bin", "group1-shard47of63.bin", "group1-shard48of63.bin", "group1-shard49of63.bin", "group1-shard50of63.bin", "group1-shard51of63.bin", "group1-shard52of63.bin", "group1-shard53of63.bin", "group1-shard54of63.bin", "group1-shard55of63.bin", "group1-shard56of63.bin", "group1-shard57of63.bin", "group1-shard58of63.bin", "group1-shard59of63.bin", "group1-shard60of63.bin", "group1-shard61of63.bin", "group1-shard62of63.bin", "group1-shard63of63.bin"], "weights": [{"name": "batch_normalization_55/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_55/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_55/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_55/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_56/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_56/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_56/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_56/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_57/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_57/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_57/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_57/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_58/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_58/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_58/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_58/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_59/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_59/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_59/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_59/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_60/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_60/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_60/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_60/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_61/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_61/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_61/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_61/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_62/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_62/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_62/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_62/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_63/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_63/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_63/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_63/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_64/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_64/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_64/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_64/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_65/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_65/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_65/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_65/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_80/kernel", "shape": [3, 3, 1024, 1024], "dtype": "float32"}, {"name": "conv2d_80/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_81/kernel", "shape": [3, 3, 1024, 1024], "dtype": "float32"}, {"name": "conv2d_81/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_82/kernel", "shape": [3, 3, 1024, 1024], "dtype": "float32"}, {"name": "conv2d_82/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_83/kernel", "shape": [3, 3, 1024, 512], "dtype": "float32"}, {"name": "conv2d_83/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_84/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_84/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_85/kernel", "shape": [3, 3, 1024, 512], "dtype": "float32"}, {"name": "conv2d_85/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_86/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "conv2d_86/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_87/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_87/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_88/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "conv2d_88/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_89/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_89/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_90/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_90/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_91/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_91/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_92/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_92/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_93/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_93/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_94/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_94/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_95/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"}, {"name": "conv2d_95/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_transpose_50/kernel", "shape": [2, 2, 1024, 1024], "dtype": "float32"}, {"name": "conv2d_transpose_50/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_transpose_51/kernel", "shape": [2, 2, 1024, 1024], "dtype": "float32"}, {"name": "conv2d_transpose_51/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_transpose_52/kernel", "shape": [2, 2, 1024, 1024], "dtype": "float32"}, {"name": "conv2d_transpose_52/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_transpose_53/kernel", "shape": [2, 2, 1024, 1024], "dtype": "float32"}, {"name": "conv2d_transpose_53/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_transpose_54/kernel", "shape": [2, 2, 512, 512], "dtype": "float32"}, {"name": "conv2d_transpose_54/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_55/kernel", "shape": [2, 2, 512, 512], "dtype": "float32"}, {"name": "conv2d_transpose_55/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_56/kernel", "shape": [2, 2, 256, 256], "dtype": "float32"}, {"name": "conv2d_transpose_56/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_57/kernel", "shape": [2, 2, 256, 256], "dtype": "float32"}, {"name": "conv2d_transpose_57/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_58/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_transpose_58/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_59/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_transpose_59/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [128, 16384], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [16384], "dtype": "float32"}]}]}